
"_BASE_USED_" = "hu";
/* Use the _ADVANCED_EXTRA_WIDTH_ (if needed) to fit the method description properly */
"_ADVANCED_EXTRA_WIDTH_" = "0.0";
/* Use the _PREFERENCES_EXTRA_WIDTH_ (if needed) to fit the action to perform description properly */
"_PREFERENCES_EXTRA_WIDTH_" = "0.0";
"General" = "Általános";
"File Access" = "Hozzáférés a fájlhoz";
"Performance" = "Performance";
"Finder Extension" = "Finder Extension";
"Love" = "Love";
"OK" = "OK";
"Done" = "OK";
"Yes" = "Igen";
"No" = "Nem";
"Don't show again" = "Ne mutasd újra";
"Set as default compressor" = "Beállítás alapértelmezettnek";
"Not now" = "Most nem";
"Want to make Keka your default compressor?" = "Szeretnéd, hogy a Keka legyen az alapértelmezett tömörítőprogram?";
"This means that all the compatible files will be extracted with Keka by now. You can set this later in the Keka Preferences." = "Ez azt jelenti, hogy az összes kompatibilis fájl ezzel a programmal fog megnyílni. Később is betudom állítani a Keka beállításai közt.";
"Really want to close Keka?" = "Biztosan bezárod a Keka-t?";
"The current operations will be canceled. If you choose to wait and quit Keka will exit when all work is done." = "A futó folyamatok meglesznek szakítva. Ha a várakozást választod, az összes folyamat befejezése után zárul be a Keka.";
"Password needed" = "Jelszó szükséges";
"File \"%@\" needs a password to be extracted" = "A \"%@\" fájl kicsomagolásához jelszóra van szükség";
"File \"%@\" needs a special encoding to be extracted" = "A \"%@\" fájlnak különleges kódolásra van szüksége a kicsomagoláshoz";
"Extraction of \"%@\" done" = "\"%@\" kicsomagolás kész.";
"Extraction of \"%@\" failed." = "\"%@\" kicsomagolása sikertelen.";
"Extraction of %i files done" = "%i fájl kicsomagolva";
"Extraction complete" = "Kicsomagolás kész";
"Extraction fail" = "A kicsomagolás során hiba lépett fel";
"Compression complete" = "Tömörítés kész";
"File \"%@\" created" = "\"%@\" létrehozva";
"Compression fail" = "A tömörítés során hiba lépett fel";
"File \"%@\" cannot be created" = "\"%@\" nem hozható létre";
"\n(using fallback folder)" = "\n(using fallback folder)";
"Operation not implemented" = "A funkció még nincs a programban";
"Performing operation..." = "Művelet előkészítése...";
"Waiting..." = "Várakozás...";
"Extracting \"%@\"" = "\"%@\" kicsomagolása";
"Extracting \"%@...\"" = "\"%@...\" kicsomagolása";
"Creating %@ file..." = "%@ fájl létrehozása...";
"Creating file \"%@\"" = "\"%@\" létrehozása";
"Creating file \"%@...\"" = "\"%@...\" létrehozása";
"Volume name:" = "Képfájl neve:";
"Select the encoding for \"%@\"" = "Válassz kódolást a következőhöz: \"%@\"";
"Time elapsed: %d:%@%d:%@%d hours%@" = "Eltelt idő: %d:%@%d:%@%d óra%@";
"Time elapsed: %d:%@%d minutes%@" = "Eltelt idő: %d:%@%d perc%@";
"Time elapsed: %d seconds%@" = "Eltelt idő: %d másodperc%@";
"%.0f seconds" = "%.0f másodperc";
"%i:%02i minutes" = "%i:%02i perc";
"%i:%02i:%02i hours" = "%i:%02i:%02i óra";
"Pause" = "Szüneteltetés";
"Continue" = "Folytatás";
"Operation paused" = "Szüneteltetve";
"Cancel" = "Mégse";
"Close" = "Bezár";
"Operation failed" = "A művelet megszakadt";
"Operation failed with error code %d" = "A művelet megszakadt a következő hibakóddal: %d";
"Choose a name and folder to start the compression" = "Válaszd ki a fájlnevet és a célmappát a tömörítés elkezdéséhez";
"Creation of \"%@\" failed" = "\"%@\" létrehozása sikertelen";
"Creating \"%@\"" = "\"%@\" létrehozása";
"Preparing extraction..." = "A kicsomagolás előkészítése…";
"Choose a folder to extract this file" = "Válassz célmappát";
"Choose where do you want to extract \"%@\"" = "Válassz célmappát a(z) \"%@\" kicsomagolásához";
"Select all the volumes from \"%@\" or the folder that contains them" = "Válaszd ki az összes kötetet a(z) \"%@\"-ból/ből vagy a mappát, amely tartalmazza";
"Select the folder that contains \"%@\"" = "Válassz mappát, ami a következőt tartalmazza: \"%@\"";
"Extraction of \"%@\" failed" = "\"%@\" kicsomagolás sikertelen";
"Keka - %i on queue" = "Keka - %i sorban áll";
"Keka can't create this %@ image" = "A Keka nem tudja elkészíteni ezt az %@ fájlt";
"You can only create %@ images with a single folder. Try to put all your files in a folder and drop it to Keka to create the %@ image." = "Csak egyetlen mappáról tudsz %@ lemezképfájlt készíteni. Próbáld az összes fájlodat egy mappába rendezni, majd azt az egy mappát a Keka-ra húzni.";
"Keka can't create this @% tarball" = "A Keka nem tudja elkészíteni ezt a(z) @% tömörített TAR archívum";
"This operation is not supported on %@." = "Ez a művelet nem támogatott a %@-on.";
"Compress \"%@\" in %@ to..." = "\"%@\" tömörítése, %@ formátumban...";
"Compress in %@ to..." = "Tömörítés %@ formátumban...";
"Save as:" = "Mentés mint:";
"Compress" = "Tömörítés";
"Extract \"%@\" to..." = "\"%@\" kicsomagolása ide…";
"Extract as:" = "Kicsomagolás mint:";
"Extract" = "Kicsomagolás";
"About %i seconds" = "About %i seconds";
"About %i minutes" = "About %i minutes";
"About %i hours" = "About %i hours";
"About %i days" = "About %i days";
"About %i weeks" = "About %i weeks";
"About %i months" = "About %i months";
"About %i years" = "About %i years";
"About a minute" = "About a minute";
"About an hour" = "About an hour";
"About a day" = "About a day";
"About a week" = "About a week";
"About a month" = "About a month";
"About a year" = "About a year";
"Finishing..." = "Finishing...";
"Can't show progress time..." = "Nem kiírható…";
"Password for \"%@\"" = "\"%@\" jelszava";
"Format" = "Formátum";
"Method" = "Tömörítés mértéke";
"Method:" = "Mód:";
"No compression" = "Nincs tömörítés";
"Fastest, less compression" = "Gyors, Legkevesebb tömörítés";
"Fast, less compression" = "Kevés tömörítés";
"Normal" = "Normál";
"Slow, more compression" = "Jobb tömörítés";
"Slowest, more compression" = "Lassú, legjobb tömörítés";
"Compression" = "Tömörítés";
"Extraction" = "Kicsomagolás";
"Keka can't use the \"extlx.plist\" list, please get in contact with the developers.\n\nNow Keka will quit." = "A Keka nem tudja használni a \"extlx.plist\" fájlt, lépj kapcsolatba a fejlesztővel.\n\nA Keka most kilép.";
"Keka is dying!" = "Keka is dying!";
"Ask each time" = "Rákérdezés minden alkalommal";
"Next to original file" = "A forrás mappája";
"Custom folder..." = "Egyéni mappa...";
"Same as original file" = "A forrás neve";
"Custom name..." = "Egyéni név...";
"Archive" = "Archívum";
"Set as default folder" = "Alapértelmezett mappa beállítása";
"Perform automatic action" = "Automatikus művelet";
"Always compress" = "Mindig tömörít";
"Always extract" = "Mindig kicsomagol";
"1.4 MB Floppy" = "1.4 MB hajlékonylemez";
"650 MB CD" = "650 MB CD";
"700 MB CD" = "700 MB CD";
"4.7 GB DVD" = "4.7 GB DVD";
"Drop here to extract" = "Húzd ide a kicsomagoláshoz";
"Drop here to compress" = "Húzd ide a tömörítéshez";
"Binary \"%@\" is not accessible" = "A \"%@\" binary nem elérhető";
"The first part \"%@\" can't be found" = "Az első darab \"%@\" nem található";
"Unable to extract a folder" = "Unable to extract a folder";
"unknown" = "ismeretlen";
"Unknown error" = "Ismeretlen hiba";
"Error code %d using \"%@\"\n%@" = "Hibakód %d, a következőt használva: \"%@\"\n%@";
"Keka was unable to create the extraction package" = "Keka was unable to create the extraction package";
"No errors found" = "Nem található hiba";
"Minor error, the operation may be done well" = "Kisebb hiba lépett fel, de a művelet még lehet, hogy jól végrehajtható";
"Fatal error" = "Kritikus hiba";
"CRC error occurred, maybe the file is corrupt" = "CRC hiba, a fájl hibás lehet";
"Attempt to modify an archive previously locked" = "Egy korábban zárolt archív módosítása";
"Maybe you don't have permission to write or your disk is full" = "Talán nincs jogosultságot az íráshoz, vagy nincs elég hely a lemezen";
"Can't open the file, maybe you don't have read permission" = "A fájl nem nyitható meg, lehet nincs jogosultságod az olvasáshoz";
"Command line error, please contact with the developer" = "Parancssori hiba, lépj kapcsolatba a fejlesztővel";
"Not enough memory. Try to close some programs and repeat the operation" = "Nincs elég memória. Zárj be pár programot, és próbáld meg újra";
"Can't create the file, maybe you don't have permission or free space" = "A fájl nem hozható létre, nincs jogosultságod, vagy elég hely a lemezen";
"Canceled manually" = "Felhasználó által leállítva";
"Bad password, try again" = "Rossz jelszó, próbáld újra";
"This archive is locked" = "Az archívum jelszóval védett";
"Write error. No permission? No space left?" = "Írási hiba. Nincs jogosultság? Nincs több hely?";
"Can't open the file, maybe it's not accessible" = "A fájl nem nyitható meg, talán nem elérhető";
"No files matching the mask" = "Nem található a feltételnek megfelelő fájl";
"There were some read errors" = "There were some read errors";
"Give access" = "Engedélyezd";
"Just folder access" = "Csak a mappához való hozzáférés";
"Quit" = "Kilépés";
"More information" = "Több információ";
"Keka needs file access" = "A Keka-nak szüksége van a fájlokhoz való hozzáféréshez";
"Give home access" = "Engedélyezd a kezdőmappához való hozzáférést";
"Customize" = "Testreszabás";
"Keka needs access to the source file/s." = "Keka needs access to the source file/s.";
"In order to work seamlessly with your files, Keka needs local access to the Mac disk." = "Ahhoz, hogy a Keka zökkenőmentesen tudjon dolgozni a fájljaiddal helyi hozzáférésre van szüksége a Mac lemezhez.";
"\nSimply click on \"Give access to Keka\", your disk should already be selected." = "\nCsak kattints a következőre: \"Give access to Keka\", a lemezednek már kiválasztva kellene lennie.";
"Give access to Keka" = "Engedélyezés a Keka-nak";
"Full Mac access (Recommended)" = "Teljes hozzáférés a Mac-hez (Javasolt)";
"Home folder access" = "Kezdőmappához való hozzáférés";
"External volumes access" = "Külső kötethez való hozzáférés";
"Full Mac" = "Full Mac";
"Home folder" = "Home folder";
"External volumes" = "External volumes";
"Show in context menu" = "Show in context menu";
"External disk: %@" = "Külső lemez: %@";
"An extension is required" = "Egy bővítmény szükséges";
"In order to set Keka as the default application, you need to install an extension. Click on \"More information\" to follow the required steps.\n\nRemember that you can always set Keka as the default application for any format using the Finder's \"Get Info\" panel." = "Bővítményre van szükség ahhoz, hogy a Keka-t alapértelmezett programként beállíthasd. Az ehhez szükséges lépésekért kattints a \"More information\"-ra.\n\nNe feledd, hogy a Keka-t bármikor beállíthatod alapértelmezett programként bármilyen fájlformátumra a Finder-ben a \"Get Info\" panel segítségével.";
"Your installed extension is obsolete and you should update it." = "Your installed extension is obsolete and you should update it.";
"Update" = "Update";
"Cannot set Keka as default" = "Nem sikerült a Keka-t alapértelmezettként beállítani";
"The intermediate application failed to launch. There is more information in the Console.app." = "A közbenső alkalmazásnak nem sikerült elindulni. Több információ a Console.app-ban.";
"The intermediate application returned an undefined code." = "A közbenső alkalmazás nem definiált kódot küldött.";
"Keka is now set as the default application for its known formats." = "A Keka az általa ismert fájlformátumnak az alapértelmezett alkalmazása.";
"Keka set as default" = "Keka beállítva alapértelmezettként";
"There were some errors while registering the formats. There is more information in the Console.app." = "Hiba lépett fel a fájlformátumok regisztrálásánál. Több információ a Console.app-ban.";
"The intermediate application can't get access to Keka." = "A közbenső alkalmazásnak nem sikerült elérnie a Keka-t.";
"The intermediate application can't find Keka." = "A közbenső alkalmazás nem találja a Keka-t.";
"Show in Finder" = "Show in Finder";
"Delete" = "Delete";
"Continue without encryption" = "Continue without encryption";
"The password does not match" = "The password does not match";
"The password is not properly set and the file cannot be encrypted. You can cancel and set the password again or continue the process without encryption." = "The password is not properly set and the file cannot be encrypted. You can cancel and set the password again or continue the process without encryption.";
"Use legacy encryption" = "Use legacy encryption";
"Using AES-256 encryption in ZIP" = "Using AES-256 encryption in ZIP";
"Note that most modern operating systems such as macOS (before macOS 11.0 Big Sur) or Windows do not support AES-256 encrypted ZIPs by default.\n\nYou can open those files easily with most third party extraction utilities." = "Note that most modern operating systems such as macOS (before macOS 11.0 Big Sur) or Windows do not support AES-256 encrypted ZIPs by default.\n\nYou can open those files easily with most third party extraction utilities.";
"Cannot create the file" = "Cannot create the file";
"Keka has no file access to the source file/s\nGive it access when asked or manually in the Preferences" = "Keka has no file access to the source file/s\nGive it access when asked or manually in the Preferences";
"Give access to the source/s folder/s" = "Give access to the source/s folder/s";
"Give access to the compressed file" = "Give access to the compressed file";
"The extension is enabled" = "The extension is enabled";
"The extension is disabled" = "The extension is disabled";
"Enable or disable the extension" = "Enable or disable the extension";
"Keka will decide whether to compress or uncompress based on file format and extension. This is the recommended option." = "Keka will decide whether to compress or uncompress based on file format and extension. This is the recommended option.";
"Keka will compress all files, even those that are already compressed. You can compress an already compressed file in automatic mode by dropping it to the bottom part of the drop zone." = "Keka will compress all files, even those that are already compressed. You can compress an already compressed file in automatic mode by dropping it to the bottom part of the drop zone.";
"Keka will try to extract all files. You can try to extract an unknown file in automatic mode by dropping it in the bottom part of the drop zone." = "Keka will try to extract all files. You can try to extract an unknown file in automatic mode by dropping it in the bottom part of the drop zone.";
"Show the operation log" = "Show the operation log";
"Unable to process tips" = "Unable to process tips";
"Already tipping a monthly %@" = "Already tipping a monthly %@";
"Send a monthly %@ tip" = "Send a monthly %@ tip";
"Send a %@ tip" = "Send a %@ tip";
"Give Keka some love ♥" = "Give Keka some love ♥";
"All extractions will be expanded at this location." = "All extractions will be expanded at this location.";
"All compressions will be stored at this location." = "All compressions will be stored at this location.";
"You'll be asked where to extract each operation." = "You'll be asked where to extract each operation.";
"You'll be asked where to compress each operation." = "You'll be asked where to compress each operation.";
"If Keka has File Access it will execute the operation near the source file/s, otherwise it will ask for a location. You can set Keka's File Access in the Preferences tab so this option works properly." = "If Keka has File Access it will execute the operation near the source file/s, otherwise it will ask for a location. You can set Keka's File Access in the Preferences tab so this option works properly.";
"Keka has no file access to the destination folder so it needs to ask for a location.\nYou can add access to this and other folders in Keka's Preferences File Access pane." = "Keka has no file access to the destination folder so it needs to ask for a location.\nYou can add access to this and other folders in Keka's Preferences File Access pane.";
"The characters %@ are not compatible with the %@ format" = "The characters %@ are not compatible with the %@ format";
"The character %@ is not compatible with the %@ format" = "The character %@ is not compatible with the %@ format";
"Stop compressing" = "Stop compressing";
"Stop extracting" = "Stop extracting";
"Resume compressing" = "Resume compressing";
"Resume extracting" = "Resume extracting";
"Pause compressing" = "Pause compressing";
"Pause extracting" = "Pause extracting";
"Compression paused" = "Compression paused";
"Extraction paused" = "Extraction paused";
"Waiting for password" = "Waiting for password";
"On queue" = "On queue";
"Applying quarantine..." = "Applying quarantine...";

/*
// MAS tips
// Note this will be used in Apple's servers
// Apple needs to have MAS translated in this language so this strings can be used
// The language used in MAS/AppleID will be used in Keka's tip strings and may not match Keka's localization
// Note that the short string is limited to 30 characters and the long string is limited to 45 characters
// Emojis cannot be used in these strings :(
*/
"Monthly sip of coffee" = "Monthly sip of coffee";
"Gift Keka a sip of coffee each month" = "Gift Keka a sip of coffee each month";
"Monthly coffee" = "Monthly coffee";
"Gift Keka a coffee each month" = "Gift Keka a coffee each month";
"Monthly pair of coffees" = "Monthly pair of coffees";
"Gift Keka a couple coffees each month" = "Gift Keka a couple coffees each month";
"Monthly breakfast" = "Monthly breakfast";
"Gift Keka a breakfast each month" = "Gift Keka a breakfast each month";
"Tip a coffee" = "Tip a coffee";
"Tip Keka a coffee so it can stay awake" = "Tip Keka a coffee so it can stay awake";
"Tip a breakfast" = "Tip a breakfast";
"Tip Keka a breakfast so it can start fresh" = "Tip Keka a breakfast so it can start fresh";
"Tip a lunch" = "Tip a lunch";
"Tip Keka a lunch and feed it" = "Tip Keka a lunch and feed it";
"Tip a dinner" = "Tip a dinner";
"Tip Keka a dinner so it keeps rolling" = "Tip Keka a dinner so it keeps rolling";
"Tip a bunch of food" = "Tip a bunch of food";
"Tip Keka a new bunch of food to keep rolling" = "Tip Keka a new bunch of food to keep rolling";
